<a href="https://colab.research.google.com/github/hmead15/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/HM_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-08-05 20:38:19--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.233.157
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.233.157|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  43.6MB/s    in 4.9s

2020-08-05 20:38:24 (39.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [ ]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [ ]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [ ]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [ ]:
#Looks like I need just the order data from the two product_order csvs,
#but because don't have item names, so I need to merge it with the product csv
#then i just count the values in my new merged df

df_products = pd.read_csv('products.csv')
df_order_products1 = pd.read_csv('order_products__prior.csv')
df_order_products2 = pd.read_csv('order_products__train.csv')
df_order_products = pd.concat([df_order_products1,df_order_products2])

In [ ]:
df_products.columns
df_order_products.columns

Index(['order_id', 'product_id', 'add_to_cart_order', 'reordered'], dtype='object')

### STRUGGLE CELL BELOW

In [ ]:
bananas = (df_products['product_name']) == 'Banana'
bag_bananas = (df_products['product_name']) == 'Bag of Organic Bananas'
org_strawberries = (df_products['product_name']) == 'Organic Strawberries'
spinach = (df_products['product_name']) == 'Organic Baby Spinach'
hass_avocado = (df_products['product_name']) == 'Organic Hass Avocado'
avocado = (df_products['product_name']) == 'Organic Avocado'
lemon = (df_products['product_name']) == 'Large Lemon'
strawberries = (df_products['product_name']) == 'Strawberries'
limes = (df_products['product_name']) == 'Limes'
milk = (df_products['product_name']) == 'Organic Whole Milk'

#stuck here too, trying to get item_id so I can merge witb df_order_products

#def get_item_id(dataframe, condition):
 # return dataframe[condition].values[0][0]

#get_item_id(df_products[bananas])

#rabbit hole

bananas_id = df_products[bananas].values[0][0]
bag_bananas_id = df_products[bag_bananas].values[0][0]
org_strawberries_id = df_products[org_strawberries].values[0][0]
spinach_id = df_products[spinach].values[0][0]
hass_avocado_id = df_products[hass_avocado].values[0][0]
avocado_id = df_products[avocado].values[0][0]
lemon_id = df_products[lemon].values[0][0]
strawberries_id = df_products[strawberries].values[0][0]
limes_id = df_products[limes].values[0][0]
milk_id = df_products[milk].values[0][0]

In [ ]:
top_items = ['Banana',
'Bag of Organic Bananas',
'Organic Strawberries',
'Organic Baby Spinach',
'Organic Hass Avocado',
'Organic Avocado',
'Large Lemon',
'Strawberries',
'Limes',
'Organic Whole Milk']

#figured out .isin() method, not quite sure why it works

condition = df_products['product_name'].isin(top_items)

df_products2 = df_products[condition]

In [ ]:
HMmerge1 = pd.merge(df_order_products,df_products2, how = 'inner', on='product_id')
top_items = merge1['product_name'].value_counts()

top_items

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [111]:
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T;

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [113]:
table2=table2.reset_index()
table2

   level_0       index  John Smith  Jane Doe  Mary Johnson
0        0  treatmenta         NaN      16.0           3.0
1        1  treatmentb         2.0      11.0           1.0

In [142]:
                    #unique identifier            variables
tidy = table2.melt(id_vars='index',value_vars=['John Smith','Jane Doe', 'Mary Johnson'])
tidy = tidy[['variable', 'index','value']]

#tidy = tidy['value'].fillna(-1) just trying to cast as int
#tidy = tidy['value'].astype(int)
#tidy.value.fillna(-1)

tidy.columns = ['Patient','Treatment','Result']

In [143]:
def strip_treatment(cell_contents):
  return cell_contents[-1]

In [144]:
tidy.Treatment = tidy.Treatment.apply(strip_treatment)

In [146]:
tidy

        Patient Treatment  Result
0    John Smith         a     NaN
1    John Smith         b     2.0
2      Jane Doe         a    16.0
3      Jane Doe         b    11.0
4  Mary Johnson         a     3.0
5  Mary Johnson         b     1.0

In [147]:
#tidy --> table2

In [150]:
table2_ver2 = tidy.pivot_table(index='Patient',columns='Treatment', values='Result')
table2_ver2

Treatment        a     b
Patient
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [109]:
flights = sns.load_dataset('flights')

In [152]:
# Create a pivot table showing the number of passengers by month and year. 
# Use year for the index and month for the columns. 
# Goal: 112 passengers for January 1949 and 432 passengers for December 1960.

table = flights.pivot_table(index='year', columns='month')
table

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####